Results/Verifications/S2427/bottleneck-determination/update_index/threads-16/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=16 oltp_update_index --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 3793.52 qps: 3793.52 (r/w/o: 0.00/3702.35/91.16) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 3699.53 qps: 3699.53 (r/w/o: 0.00/3612.03/87.50) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 3787.53 qps: 3787.53 (r/w/o: 0.00/3693.72/93.80) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 3795.96 qps: 3795.96 (r/w/o: 0.00/3706.76/89.20) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 3870.60 qps: 3870.60 (r/w/o: 0.00/3778.40/92.20) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 3688.41 qps: 3688.41 (r/w/o: 0.00/3598.41/90.00) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 3503.11 qps: 3503.11 (r/w/o: 0.00/3420.91/82.20) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 2665.11 qps: 2665.11 (r/w/o: 0.00/2600.31/64.80) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 3189.27 qps: 3189.27 (r/w/o: 0.00/3109.07/80.20) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 3040.92 qps: 3040.92 (r/w/o: 0.00/2965.43/75.49) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           341908
        other:                           8466
        total:                           350374
    transactions:                        350374 (3503.29 per sec.)
    queries:                             350374 (3503.29 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0083s
    total number of events:              350374

Latency (ms):
         min:                                    1.16
         avg:                                    4.56
         max:                                  262.82
         95th percentile:                        7.70
         sum:                              1599455.39

Threads fairness:
    events (avg/stddev):           21898.3750/51.69
    execution time (avg/stddev):   99.9660/0.00


real    1m40.125s
user    0m5.945s
sys     0m14.576s